app/controllers/users_controller.rb

INSERT INTO "users" ("session_id", "country", "candy_fan", "polish_candy_fan", "night_club_fan", "pierrogi_fan", "fan_type", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
---
  def create
    @user = User.new(permitted_params.merge(session_id: session.id))
    if @user.save